{
    "projects":[
            {"project":{
                    "title":"MWD",
                    "git":"https://github.com/kaigikinyua/MWD",
                    "status":"In Progress",
                    "short_desc":"A multiplayer tic tac toe game",
                    "description":[
                            {"paragraph":"This web application allows you to play tic tac toe with a wide variety of people online"},
                            {"paragraph":"You can get an invite or send a player an invite and if either party accepts then you are directed to an arena"},
                            {"paragraph":"I am currently working on the various observation improvements after releasing the beta on 22 June 2020"},
                            {"paragraph":"If you would like to have a go at it you can visit <a href='https://antonytictac.herokuapp.com/' style='text-decoration:underline;color:blue;'>antonytictac</a> to have a look dont forget to invite a friend :)"}
                    ],
                    "images":[
                                {"image":"static/Projects/mwd/Landing.png"},
                                {"image":"static/Projects/mwd/players.png"}
                            ]
                }
            },

            {"project":{
                    "title":"PyN",
                    "git":"https://github.com/kaigikinyua/AutoDoc",
                    "status":"complete",
                    "short_desc":"A file sharing application using the web",
                    "description":[
                            {"paragraph":"Have you ever wanted to watch a film on your phone from your laptop? Look no further PyN will do the trick!!"},
                            {"paragraph":"PyN is a file sharing application that I created. It composes of a desktop application built with Python and a webserver built using nodeJS that distributes the files."},
                            {"paragraph":" Users can access files from the browser if the host  and the client are on the same network You can read the documentation on my github"},
                            {"paragraph":"For the Gui I used python's tkinter gui library and on starting the server you make a system call to run the server."},
                            {"paragraph":"NodeJS was picked for this project mainly because it can be easily packaged for distribution to other computers. However other goodies such as single threaded event loop and v8 engine were considered."}
                    ],
                    "images":[
                                {"image":"static/Projects/share/share.png"},
                                {"image":"static/Projects/share/tab.png"},
                                {"image":"static/Projects/share/desktop.png"},
                                {"image":"static/Projects/share/dashboard.png"}
                            ]
                }
            },
            {
                "project":{
                    "title":"AutoDoc",
                    "git":"https://github.com/kaigikinyua/AutoDoc",
                    "status":"In progress",
                    "short_desc":"Open source source code auto documentation script.",
                    "description":[
                            {"paragraph":"AutoDoc is a script that currently allows developers to generate markdown documentation from the comments that were already in their source code as a guide or roadmap to other developers"},
                            {"paragraph":"You can checkout the github link attached to get a full disclosure of how to use it."},
                            {"paragraph":"I used Python3 to develop the cli application. This is mainly because I needed a language that can be used to do system operations with ease, shorten development time and has OOP since there are different blue prints which have simmilar behaviours"},
                            {"paragraph":"The application was developed as a cli since it is mostly designed for developers to auto generate documentation for other developers"},
                            {"paragraph":"I have attached some design images so that you can get a clue of what is under the hood."}
                    ],
                    "images":[
                            {"image":"static/Projects/autoDoc/autoDoc.png"},
                            {"image":"static/Projects/autoDoc/logs.png"},
                            {"image":"static/Projects/autoDoc/markdown.png"}
                        ] 
                }
            },
            {
                "project":{
                    "title":"UI/UX",
                    "git":"https://github.com/kaigikinyua/UiDesigns",
                    "status":"complete",
                    "short_desc":"UI/UX concepts and implementations of various applications",
                    "description":[
                        {"paragraph":"This is my collection of User Interface and User Experience design and implementation of varous apps and sites."},
                        {"paragraph":"These interface collection is however just a training ground to test various front end technologies and frameworks."}
                    ],
                    "images":[
                            {"image":"static/Projects/ui/1.png"},
                            {"image":"static/Projects/ui/2.png"},
                            {"image":"static/Projects/ui/3.png"}
                        ]
                    }
            },
            {
                "project":{
                    "title":"Hotel Sample Project",
                    "git":"https://github.com/kaigikinyua/Class_and_Lab/tree/master/Frontend/frameworks_and_libs/vue/vueone",
                    "status":"complete",
                    "short_desc":"UI implementation of a hotels website",
                    "description":[
                        {"paragraph":"This is a project that features a hotel landing page, services, contacts and authentication."},
                        {"paragraph":"This is website can be customized to fit different industries and ventures."},
                        {"paragraph":"You can visit the site using this link <a href='https://kaigikinyua.github.io/StaticPortfolio/static_web_projects/vueone/index.html'>Hotel Site</a>"}
                    ],
                    "images":[]
                    }
            }
    ]
}